package com.example.militaryfreelancer.Models.Customer;

import org.springframework.stereotype.Component;


public enum Rank {
    СОЛДАТ,
    СТАРШИЙ_СОЛДАТ,
    МОЛОДШИЙ_СЕРЖАН,
    СЕРЖАНТ,
    СТАРШИЙ_СЕРЖАНТ,
    ГОЛОВНИЙ_СЕРЖАНТ,
    ШТАБ_СЕРЖАНТ,
    МАЙСТЕР_СЕРЖАНТ,
    СТАРШИЙ_МАЙСТЕР_СЕРЖАНТ,
    ГОЛОВНИЙ_МАЙСТЕР_СЕРЖАНТ,
    ЛЕЙТЕНАНТ,
    СТАРШИЙ_ЛЕЙТЕНАНТ,
    КАПІТАН,
    МАЙОР,
    ПІДПОЛКОВНИК,
    ПОЛКОВНИК,
    БРИГАДНИЙ_ГЕНЕРАЛ,
    ГЕНЕРАЛ_МАЙОР,
    ГЕНЕРАЛ_ЛЕЙТЕНАНТ,
    ГЕНЕРАЛ
}
